sdaiPutAttrsBN(Sdai_instS*,System.Int32,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,SdaiPrimitiveType,BTEllipsis)
\details
Sets new values to specified application instance attributes.
\param appInstance   [in] An application instance that contains the attributes.
\param numberAttr    [in] A number of attributes to set their values.
\param attributeName [in] A string that contains the attribute name.
\param valueType     [in] An attribute value type.
\code
SdaiModel model = ...;
SdaiAppInstance startPoint = sdaiCreateInstanceBN(model, "IfcCartesianPoint");
SdaiAppInstance lineSegment2D = sdaiCreateInstanceBN(model, "IfcLineSegment2D");
sdaiPutAttrsBN(lineSegment2D, 3,
"StartPoint", sdaiINSTANCE, startPoint,
"StartDirection", sdaiREAL, startDirection,
"SegmentLength", sdaiREAL, segmentLength);
\remarks
The function is case insensitive.
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiRP_NOPN - Repository is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiMX_NRW - SDAI-model access is not read-write.
* sdaiEI_NEXS - Instance does not exist.
* sdaiAT_NDEF - Attribute not defined.
* sdaiAT_NVLD - Attribute invalid.
* sdaiVT_NVLD - Value type invalid.
* sdaiSY_ERR - Underlying system error.